TrampolineRTOS/trampoline/machines/cortex-m/armv7em/efm32wg/emlib/inc/em_opamp.h
/** Configuration of OPA0 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA0                                             \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA1                                             \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelDefault,             /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,           /* Disable resistor ladder.                */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA2                                             \
  {                                                                             \
    opaNegSelResTap,              /* Input from resistor ladder tap.         */ \
    opaPosSelResTap,              /* Input from OPA0 resistor ladder tap.    */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxOpaIn,             /* Resistor ladder input from OPA1.        */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in two-opamp instrumentation amplifier mode. */
#define OPA_INIT_INSTR_AMP_OPA0                                                 \
  {                                                                             \
    opaNegSelResTap,              /* Input from resistor ladder tap.         */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxCenter,            /* OPA0/OPA1 resistor ladders connected.   */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in two-opamp instrumentation amplifier mode. */
#define OPA_INIT_INSTR_AMP_OPA1                                                 \
  {                                                                             \
    opaNegSelNegPad,              /* Neg input from pad.                     */ \
    opaPosSelResTap,              /* Input from resistor ladder tap.         */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxCenter,            /* OPA0/OPA1 resistor ladders connected.   */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

#endif /* defined(_SILICON_LABS_32B_SERIES_0) */

/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

#if defined(_SILICON_LABS_32B_SERIES_0)
void      OPAMP_Disable(DAC_TypeDef *dac, OPAMP_TypeDef opa);
void      OPAMP_Enable(DAC_TypeDef *dac, OPAMP_TypeDef opa, const OPAMP_Init_TypeDef *init);
#elif defined(_SILICON_LABS_32B_SERIES_1)
void      OPAMP_Disable(VDAC_TypeDef *dac, OPAMP_TypeDef opa);
void      OPAMP_Enable(VDAC_TypeDef *dac, OPAMP_TypeDef opa, const OPAMP_Init_TypeDef *init);
#endif /* defined(_SILICON_LABS_32B_SERIES_0) */

/** @} (end addtogroup OPAMP) */
/** @} (end addtogroup emlib) */

#ifdef __cplusplus
}
#endif

#endif /* (defined(OPAMP_PRESENT) && (OPAMP_COUNT == 1))
       || defined(VDAC_PRESENT) && (VDAC_COUNT > 0) */
#endif /* EM_OPAMP_H */
